<!-- немного стилей для восприятия верстки-->
<style>
    h3 {color: red;}
    p {color: #5e5e5e;}
    ul {margin: 5px;}
</style>

<?php

    //  #####################
    //  задание №1 ##########
    //  #####################

    echo '<h3>Задание №1</h3>';
    echo '<p>С помощью цикла while вывести все числа в промежутке от 0 до 100,<br> 
             которые делятся на 3 без остатка.</p>';

    $i = 1;
    $output = '';

    while ($i <= 100) {
        if ($i % 3 == 0) {
            $output .= "[$i] ";
        }
        $i++;
    }
    echo $output . '<hr>';

    //  #####################
    //  задание №2 ##########
    //  #####################

    echo '<h3>Задание №2</h3>';
    echo '<p>С помощью цикла do…while написать функцию для вывода чисел от 0 до 10,<br> 
             чтобы результат выглядел так:<br>
             0 – ноль.<br>
             1 – нечетное число.<br>
             2 – четное число.<br>
             3 – нечетное число.<br>
             …<br>
             10 – четное число.<br></p>';

    $i = 0;
    $output = '';

    do {
        if ($i == 0) {
            $output = '0 — ноль.<br>';
        } elseif ($i % 2 == 0) {
            $output .= "$i — четное число.<br>";
        } else {
            $output .= "$i — нечетное число.<br>";
        }
        $i++;
    } while ($i <= 10);
    echo $output . '<hr>';

    //  #####################
    //  задание №3 ##########
    //  #####################

    echo '<h3>Задание №3</h3>';
    echo '<p>Объявить массив, в котором в качестве ключей будут использоваться названия<br> 
             областей, а в качестве значений – массивы с названиями городов из соответствующей<br> 
             области. Вывести в цикле значения массива, чтобы результат был таким:<br>
             Московская область:<br>
             Москва, Зеленоград, Клин<br>
             Ленинградская область:<br>
             Санкт-Петербург, Всеволожск, Павловск, Кронштадт<br>
             Рязанская область … (названия городов можно найти на maps.yandex.ru)<br></p>';

    $regions = [
        "Московская область" => [
            "Москва", "Зеленоград", "Клин"
        ],
        "Ленинградская область" => [
            "Санкт-Петербург", "Всеволожск", "Павловск", "Кронштадт"
        ],
        "Рязанская область" => [
            "Касимов", "Ряжск", "Рязань‎", "Сасово‎", "Скопин‎", "Спас-Клепики"
        ]
    ];

    // реализовал два варианта решения — хотелось "пощупать" массив с разных сторон
    echo '<p>Первый вариант:</p>';
    foreach ($regions as $reg => $city) {
        echo $reg . ':<br>';
        foreach ($city as $item) {
            echo $item . '<br>';
        }
    }
    echo '<p>Второй вариант:</p>';
    foreach ($regions as $reg => $city) {
        $cityStr = implode(', ', $city);
        echo $reg . ':<br>' . $cityStr . '<br>';
    }
    echo '<hr>';

    //  #####################
    //  задание №4 ##########
    //  #####################

    echo '<h3>Задание №4</h3>';
    echo '<p>Объявить массив, индексами которого являются буквы русского языка, а значениями –<br> 
             соответствующие латинские буквосочетания (‘а’=> ’a’, ‘б’ => ‘b’, ‘в’ => ‘v’, ‘г’ => ‘g’,<br> 
             …, ‘э’ => ‘e’, ‘ю’ => ‘yu’, ‘я’ => ‘ya’). Написать функцию транслитерации строк.</p>';

    function transliteration($str)
    {
        $abc = [
            "а" => "a", "б" => "b", "в" => "v", "г" => "g", "д" => "d", "е" => "e",
            "ё" => "yo", "ж" => "zh", "з" => "z", "и" => "i", "й" => "y", "к" => "k",
            "л" => "l", "м" => "m", "н" => "n", "о" => "o", "п" => "p", "р" => "r",
            "с" => "s", "т" => "t", "у" => "u", "ф" => "f", "х" => "kh", "ц" => "ts",
            "ч" => "ch", "ш" => "sh", "щ" => "shch", "ъ" => "»", "ы" => "y", "ь" => "'",
            "э" => "e", "ю" => "yu", "я" => "ya",
            // транслитерация и для прописных букв
            "А" => "A", "Б" => "B", "В" => "V", "Г" => "G", "Д" => "D", "Е" => "E",
            "Ё" => "YO", "Ж" => "Zh", "З" => "Z", "И" => "I", "Й" => "Y", "К" => "K",
            "Л" => "L", "М" => "M", "Н" => "N", "О" => "O", "П" => "P", "Р" => "R",
            "С" => "S", "Т" => "T", "У" => "U", "Ф" => "F", "Х" => "Kh", "Ц" => "Ts",
            "Ч" => "Ch", "Ш" => "Sh", "Щ" => "Shch", "Ъ" => "»", "Ы" => "Y", "Ь" => "'",
            "Э" => "E", "Ю" => "Yu", "Я" => "Ya"
        ];
        return strtr($str, $abc);
    }

    echo transliteration('Зимы ждала, ждала природа.<br>
                          Снег выпал только в январе<br>
                          На третье в ночь.<br>');
    echo '<hr>';

    //  #####################
    //  задание №5 ##########
    //  #####################

    echo '<h3>Задание №5</h3>';
    echo '<p>Написать функцию, которая заменяет в строке пробелы<br> 
             на подчеркивания и возвращает видоизмененную строчку.</p>';

    // реализовал два варинта: strtr() и str_replace()
    function spaceReplace1($str)
    {
        return strtr($str, ' ', '_');
    }

    function spaceReplace2($subject)
    {
        return str_replace(' ', '_', $subject);
    }

    echo spaceReplace1('Мелькает, вьется первый снег,') . '<br>';
    echo spaceReplace2('Звездами падая на брег.');
    echo '<hr>';

    //  #####################
    //  задание №6 ##########
    //  #####################

    echo '<h3>Задание №6</h3>';
    echo '<p>В имеющемся шаблоне сайта заменить статичное меню (ul - li) на генерируемое через PHP.<br> 
             Необходимо представить пункты меню как элементы массива и вывести их циклом. Подумать,<br> 
             как можно реализовать меню с вложенными подменю? Попробовать его реализовать.</p>';

    $menu = [
        'Главная',
        'Товары' => [
            'Электроника',
            'Аксессуары',
            'Книги'
        ],
        'Контакты'
    ];

    // следующая php конструкция вставлется в верстку внутрь <ul></ul>
    foreach ($menu as $key => $value) {
        echo '<li>';
        if (is_array($value)) {
            echo $key;
            echo '<ul>';
            foreach ($value as $subvalue) {
                echo '<li>' . $subvalue . '</li>';
            }
            echo '</ul>';
        } else {
            echo $value;
        }
        echo '</li>';
    }

    echo '<hr>';

    //  #####################
    //  задание №7 ##########
    //  #####################

    echo '<h3>Задание №7`</h3>';
    echo '<p>*Вывести с помощью цикла for числа от 0 до 9, НЕ используя тело цикла.<br> 
             То есть выглядеть должно так:<br>
             for (…){ // здесь пусто}</p>';

    for ($i = 0; $i < 10; print($i++)) {
    }

    echo '<hr>';
    //  #####################
    //  задание №8 ##########
    //  #####################

    echo '<h3>Задание №8</h3>';
    echo '<p>*Повторить третье задание, но вывести на экран только города,<br> 
             начинающиеся с буквы «К».</p>';

    $regions = [
        "Московская область" => [
            "Москва", "Зеленоград", "Клин"
        ],
        "Ленинградская область" => [
            "Санкт-Петербург", "Всеволожск", "Павловск", "Кронштадт"
        ],
        "Рязанская область" => [
            "Касимов", "Ряжск", "Рязань‎", "Сасово‎", "Скопин‎", "Спас-Клепики"
        ]
    ];

    // не уверен в правильности выбора функции для поиска буквы,
    // однако результат получил верный
    foreach ($regions as $reg => $city) {
        echo $reg . ':<br>';
        foreach ($city as $item) {
            $pos = stripos($item, 'К');
            if ($pos === 0)
                echo $item . '<br>';
        }
    }

    echo '<hr>';
    //  #####################
    //  задание №9 ##########
    //  #####################

    echo '<h3>Задание №9</h3>';
    echo '<p>*Объединить две ранее написанные функции в одну, которая получает<br> 
             строку на русском языке, производит транслитерацию и замену пробелов<br> 
             на подчеркивания (аналогичная задача решается при конструировании<br> 
             url-адресов на основе названия статьи в блогах).</p>';

    // здесь тоже реализовал два варианта решения:
    // в первом варианте просто добавил в алфавит транслитерации правило замены — пробел => подчеркивание

    // * знаю, что в рамках данной php страницы это дублирование кода,
    //   но я намеренно не стал выносить алфавит в глобальную переменную
    function replaceV1($str)
    {
        $abc = [
            "а" => "a", "б" => "b", "в" => "v", "г" => "g", "д" => "d", "е" => "e",
            "ё" => "yo", "ж" => "zh", "з" => "z", "и" => "i", "й" => "y", "к" => "k",
            "л" => "l", "м" => "m", "н" => "n", "о" => "o", "п" => "p", "р" => "r",
            "с" => "s", "т" => "t", "у" => "u", "ф" => "f", "х" => "kh", "ц" => "ts",
            "ч" => "ch", "ш" => "sh", "щ" => "shch", "ъ" => "»", "ы" => "y", "ь" => "'",
            "э" => "e", "ю" => "yu", "я" => "ya", " " => "_",
            // транслитерация и для прописных букв
            "А" => "A", "Б" => "B", "В" => "V", "Г" => "G", "Д" => "D", "Е" => "E",
            "Ё" => "YO", "Ж" => "Zh", "З" => "Z", "И" => "I", "Й" => "Y", "К" => "K",
            "Л" => "L", "М" => "M", "Н" => "N", "О" => "O", "П" => "P", "Р" => "R",
            "С" => "S", "Т" => "T", "У" => "U", "Ф" => "F", "Х" => "Kh", "Ц" => "Ts",
            "Ч" => "Ch", "Ш" => "Sh", "Щ" => "Shch", "Ъ" => "»", "Ы" => "Y", "Ь" => "'",
            "Э" => "E", "Ю" => "Yu", "Я" => "Ya"
        ];
        return strtr($str, $abc);
    }

    echo replaceV1('Зимы ждала, ждала природа.<br>');

    function replaceV2($str)
    {
        $abc = [
            "а" => "a", "б" => "b", "в" => "v", "г" => "g", "д" => "d", "е" => "e",
            "ё" => "yo", "ж" => "zh", "з" => "z", "и" => "i", "й" => "y", "к" => "k",
            "л" => "l", "м" => "m", "н" => "n", "о" => "o", "п" => "p", "р" => "r",
            "с" => "s", "т" => "t", "у" => "u", "ф" => "f", "х" => "kh", "ц" => "ts",
            "ч" => "ch", "ш" => "sh", "щ" => "shch", "ъ" => "»", "ы" => "y", "ь" => "'",
            "э" => "e", "ю" => "yu", "я" => "ya", " " => "_",
            // транслитерация и для прописных букв
            "А" => "A", "Б" => "B", "В" => "V", "Г" => "G", "Д" => "D", "Е" => "E",
            "Ё" => "YO", "Ж" => "Zh", "З" => "Z", "И" => "I", "Й" => "Y", "К" => "K",
            "Л" => "L", "М" => "M", "Н" => "N", "О" => "O", "П" => "P", "Р" => "R",
            "С" => "S", "Т" => "T", "У" => "U", "Ф" => "F", "Х" => "Kh", "Ц" => "Ts",
            "Ч" => "Ch", "Ш" => "Sh", "Щ" => "Shch", "Ъ" => "»", "Ы" => "Y", "Ь" => "'",
            "Э" => "E", "Ю" => "Yu", "Я" => "Ya"
        ];
        $newStr = $str;
        foreach ($abc as $key => $val) {
            $newStr = str_replace($key, $val, $newStr);
        }
        return str_replace(' ', '_', $newStr);
    }

    echo replaceV2('Снег выпал только в январе.');

    echo '<hr>';